Enums/СтатусыЗаявокНаРасходованиеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СтатусыЗаявокНаРасходованиеДенежныхСредств</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Согласована</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСогласована</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КОплате</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонена</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыЗаявокСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтатусыЗаявокСотрудников</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подготовлена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Рассматривается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Согласована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отклонена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отозвана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КОплате</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ЛимитыРасходованияДенежныхСредствСервер/Ext/Module.bsl
&ИзменениеИКонтроль("ПослеЗаписиДвиженийДокумента")
Процедура РСК_ПослеЗаписиДвиженийДокумента(Документ, МенеджерВременныхТаблиц, Отказ)

	//++ НЕ УТ
	КонтролироватьЛимиты =
	ПолучитьФункциональнуюОпцию("ИспользоватьЛимитыРасходаДенежныхСредствБюджетирования")
	И ((ТипЗнч(Документ) = Тип("ДокументОбъект.ЗаявкаНаРасходованиеДенежныхСредств")
	И Документ.Статус <> Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Отклонена
	#Вставка 
	//++ Конарев снятие контроля лимитов для заявок, связанных с ДО
	И НЕ ИнтеграцияС1СДокументооборот3.ЕстьСвязанныйОбъектДО(Документ.Ссылка)
	#КонецВставки
	И Не Документ.СверхЛимита)
	Или
	(ТипЗнч(Документ) = Тип("ДокументОбъект.ЗаявкаНаКомандировку")
	И (Документ.Статус <> Перечисления.СтатусыЗаявокСотрудников.Отклонена
	И Документ.Статус <> Перечисления.СтатусыЗаявокСотрудников.Отозвана)
	И Документ.ВыдачаПодОтчет.Количество()
	И Не Документ.СверхЛимита));

	Если КонтролироватьЛимиты Тогда
		Ошибки = Неопределено;
		НарушеныТолькоИнформационныеЛимиты = Ложь;
		ЗаявкаПроходитПоЛимитамБюджетирования(Документ, Ошибки, НарушеныТолькоИнформационныеЛимиты);
			
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);

		Если ЗначениеЗаполнено(Ошибки) И Не НарушеныТолькоИнформационныеЛимиты Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;

	Если (ТипЗнч(Документ) = Тип("ДокументОбъект.ЗаявкаНаРасходованиеДенежныхСредств")
		Или ТипЗнч(Документ) = Тип("ДокументОбъект.ЗаявкаНаКомандировку"))
		И Документ.Закрыта Тогда
		Документы.ЗаявкаНаРасходованиеДенежныхСредств.ЗакрытьЗаявки(Документ.Ссылка, Истина);
	КонецЕсли;
	//-- НЕ УТ
	Возврат;

КонецПроцедуры
